Revit 2026 API

# IFCExtrusionData Methods

---

The IFCExtrusionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddLoop | Adds a curve loop to the extrusion data. |
|  | ClearLoops | Clears the curve loops stored in the extrusion data. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLoops | Gets the curve loops that form the base shape of the extrusion. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Determines if the extrusion data represents a valid extrusion. |
|  | RemoveLoopAt | Removes the loop at the specified index. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCExtrusionData Class

Autodesk.Revit.DB.IFC Namespace